Parsing_WSDL/TestCases/global_weather_wsdl.wsdl.json

[{"name":"GlobalWeather","port":[{"name":"GlobalWeatherSoap","address":"http://www.webservicex.com/globalweather.asmx","operations":[{"name":"GetWeather","actionUrl":"http://www.webserviceX.NET/GetWeather","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://www.webserviceX.NET\">\r\n  <soap:Body>\r\n    <tns:GetWeather>\r\n      <tns:CityName>string</tns:CityName>\r\n      <tns:CountryName>string</tns:CountryName>\r\n    </tns:GetWeather>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://www.webserviceX.NET\">\r\n  <soap:Body>\r\n    <tns:GetWeatherResponse>\r\n      <tns:GetWeatherResult>string</tns:GetWeatherResult>\r\n    </tns:GetWeatherResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"Get weather report for all major cities around the world.","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"},{"name":"GetCitiesByCountry","actionUrl":"http://www.webserviceX.NET/GetCitiesByCountry","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://www.webserviceX.NET\">\r\n  <soap:Body>\r\n    <tns:GetCitiesByCountry>\r\n      <tns:CountryName>string</tns:CountryName>\r\n    </tns:GetCitiesByCountry>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://www.webserviceX.NET\">\r\n  <soap:Body>\r\n    <tns:GetCitiesByCountryResponse>\r\n      <tns:GetCitiesByCountryResult>string</tns:GetCitiesByCountryResult>\r\n    </tns:GetCitiesByCountryResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"Get all major\r\n\t\t\t\tcities by country name(full / part).","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"}]},{"name":"GlobalWeatherSoap12","address":"http://www.webservicex.com/globalweather.asmx","operations":[{"name":"GetWeather","actionUrl":"http://www.webserviceX.NET/GetWeather","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://www.webserviceX.NET\">\r\n  <soap:Body>\r\n    <tns:GetWeather>\r\n      <tns:CityName>string</tns:CityName>\r\n      <tns:CountryName>string</tns:CountryName>\r\n    </tns:GetWeather>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://www.webserviceX.NET\">\r\n  <soap:Body>\r\n    <tns:GetWeatherResponse>\r\n      <tns:GetWeatherResult>string</tns:GetWeatherResult>\r\n    </tns:GetWeatherResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"Get weather report for all major cities around the world.","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"},{"name":"GetCitiesByCountry","actionUrl":"http://www.webserviceX.NET/GetCitiesByCountry","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://www.webserviceX.NET\">\r\n  <soap:Body>\r\n    <tns:GetCitiesByCountry>\r\n      <tns:CountryName>string</tns:CountryName>\r\n    </tns:GetCitiesByCountry>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://www.webserviceX.NET\">\r\n  <soap:Body>\r\n    <tns:GetCitiesByCountryResponse>\r\n      <tns:GetCitiesByCountryResult>string</tns:GetCitiesByCountryResult>\r\n    </tns:GetCitiesByCountryResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"Get all major\r\n\t\t\t\tcities by country name(full / part).","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"}]},{"name":"GlobalWeatherHttpGet","address":"http://www.webservicex.com/globalweather.asmx","operations":[{"name":"GetWeather","actionUrl":"http://www.webservicex.com/globalweather.asmx/GetWeather","input":null,"output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://www.webserviceX.NET\">\r\n  <soap:Body>\r\n    <tns:string>string</tns:string>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[{"Name":"CityName","Type":"string","DefaultValue":"string","LocationType":2,"IsXml":false},{"Name":"CountryName","Type":"string","DefaultValue":"string","LocationType":2,"IsXml":false}],"OutputParameters":[],"SendInputBodyAs":3,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"Get weather report for all major cities around the world.","BodyNamespace":null,"BodyUse":0,"BodeRequired":false,"BodyEncoding":null,"HttpVerb":"GET"},{"name":"GetCitiesByCountry","actionUrl":"http://www.webservicex.com/globalweather.asmx/GetCitiesByCountry","input":null,"output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://www.webserviceX.NET\">\r\n  <soap:Body>\r\n    <tns:string>string</tns:string>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[{"Name":"CountryName","Type":"string","DefaultValue":"string","LocationType":2,"IsXml":false}],"OutputParameters":[],"SendInputBodyAs":3,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"Get all major\r\n\t\t\t\tcities by country name(full / part).","BodyNamespace":null,"BodyUse":0,"BodeRequired":false,"BodyEncoding":null,"HttpVerb":"GET"}]},{"name":"GlobalWeatherHttpPost","address":"http://www.webservicex.com/globalweather.asmx","operations":[{"name":"GetWeather","actionUrl":"http://www.webservicex.com/globalweather.asmx/GetWeather","input":null,"output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://www.webserviceX.NET\">\r\n  <soap:Body>\r\n    <tns:string>string</tns:string>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[{"Name":"CityName","Type":"string","DefaultValue":"string","LocationType":4,"IsXml":false},{"Name":"CountryName","Type":"string","DefaultValue":"string","LocationType":4,"IsXml":false}],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"application/x-www-form-urlencoded","OutputContentType":"text/xml;charset=utf-8","Description":"Get weather report for all major cities around the world.","BodyNamespace":null,"BodyUse":0,"BodeRequired":false,"BodyEncoding":null,"HttpVerb":"POST"},{"name":"GetCitiesByCountry","actionUrl":"http://www.webservicex.com/globalweather.asmx/GetCitiesByCountry","input":null,"output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://www.webserviceX.NET\">\r\n  <soap:Body>\r\n    <tns:string>string</tns:string>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[{"Name":"CountryName","Type":"string","DefaultValue":"string","LocationType":4,"IsXml":false}],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"application/x-www-form-urlencoded","OutputContentType":"text/xml;charset=utf-8","Description":"Get all major\r\n\t\t\t\tcities by country name(full / part).","BodyNamespace":null,"BodyUse":0,"BodeRequired":false,"BodyEncoding":null,"HttpVerb":"POST"}]}]}]